0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
	value uniform (0.159 0 0);

    }
    symmetric
    {
        type symmetry;

    }
    microjet
    {
//        type            oscillatingFixedValue;
  //      refValue        uniform (0 -6.0 0);
 //       amplitude       constant 1.0;
 //       frequency       constant 143;
        type fixedValue;
	value uniform (0 0 0);
    }
    wall
    {
        type fixedValue;
	value uniform (0 0 0);
    }
    outlet1 
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    outlet2
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    outlet3
    {

        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
