0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 2e-05;
    }

    outlet3
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    symmetric
    {
        type symmetry;

    }
    microjet
    {
        type fixedValue;
	value uniform 0;
    }
    wall
    {
        type fixedValue;
	value uniform 0;
    }


}

// ************************************************************************* //
