0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type                zeroGradient;

    }
    symmetric
    {
       type            symmetry;
    }
    microjet
    {
       type            zeroGradient;
    }
    wall
    {
       type            zeroGradient;
    }
    outlet1
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        //rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    outlet2
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        //rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    outlet3
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        //rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }



}


// ************************************************************************* //
