system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          0.0000005

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
functions
{
	probes1
	{
		type probes;
		functionObjectLibs ("libsampling.so");
		enabled	true;
		outputControl	timeStep;
		outputInterval	10;

		fields
		(U);
	probeLocations
	(
		(0.0375 0 0)

	);
	}
}
functions
{
	probes2
	{
		type probes;
		functionObjectLibs ("libsampling.so");
		enabled	true;
		outputControl	timeStep;
		outputInterval	10;

		fields
		(U);
	probeLocations
	(
		(-0.017 0 0)

	);
	}
}
functions
{
	probes3
	{
		type probes;
		functionObjectLibs ("libsampling.so");
		enabled	true;
		outputControl	timeStep;
		outputInterval	10;

		fields
		(U);
	probeLocations
	(
		(0 0 0)

	);
	}
}
functions
{
	probes4
	{
		type probes;
		functionObjectLibs ("libsampling.so");
		enabled	true;
		outputControl	timeStep;
		outputInterval	10;

		fields
		(U);
	probeLocations
	(
		(0.001 0 0)

	);
	}
}

// ************************************************************************* //
